In [1]:
import pandas as pd

In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('../data/survey.db')

In [4]:
cursor = con.cursor()

In [5]:
cursor.execute("SELECT * from Site;")

In [6]:
results = cursor.fetchall()

In [7]:
results

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [8]:
pd.DataFrame(results)

       0      1       2
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [9]:
df = pd.read_sql_query('SELECT * FROM Site;', con=con)

In [10]:
df

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [11]:
cursor.close()

In [12]:
con.close()

In [26]:
with sqlite3.connect('../data/survey.db') as con:
    site = pd.read_sql_query('SELECT * FROM Site;', con=con)
    survey = pd.read_sql_query('SELECT * FROM Survey;', con=con)
    person = pd.read_sql_query('SELECT * FROM Person;', con=con)
    visited = pd.read_sql_query('SELECT * FROM Visited;', con=con)
    
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [27]:
visited

    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22

In [41]:
with sqlite3.connect('../data/survey.db') as con:
    joined = pd.read_sql_query(
        'SELECT * FROM Site JOIN Visited ON Site.name = Visited.Site;',
        con=con)

In [37]:
joined

    name    lat    long   id   site       dated
0   DR-1 -49.85 -128.57  619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57  622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57  844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72  734   DR-3  1930-01-07
4   DR-3 -47.15 -126.72  735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72  751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72  752   DR-3        None
7  MSK-4 -48.87 -123.40  837  MSK-4  1932-01-14

In [30]:
a = 3

In [32]:
f"hey a = {a + 3}"

'hey a = 6'

In [33]:
'hey a = {}'.format(a)

'hey a = 3'

In [35]:
f"""a = {a}"""

'a = 3'